app/Controllers/copeta.php

SELECT *
FROM "DataLokasiLibCaffe"
WHERE "DataLokasiLibCaffe"."deleted_at" IS NULL
---
    public function index()
    {
        $dataobjek = $this->tabledatalokasilibcaffe->findAll();