app/Controllers/Libcaffe.php

INSERT INTO "DataLokasiLibCaffe" ("nama", "deskripsi", "latitude", "longitude", "foto", "created_at", "updated_at") VALUES ('Random', 'Uji coba', '-6.92302', '107.60764', 'World_Map_Wallpapers_High_Resolution_-_Wallpaper_Cave.png', '2023-06-04 09:02:08', '2023-06-04 09:02:08')
---
            // foto tidak menggunakan post, karena perlu proses penanganan yang beda ex: size, format dll
        ];

        if (!$this->tabledatalokasilibcaffe->save($data)) {

SELECT *
FROM "DataLokasiLibCaffe"
WHERE "DataLokasiLibCaffe"."deleted_at" IS NULL
---
    public function tabell()
    {
        $data['dataobjek'] = $this->tabledatalokasilibcaffe->findAll();

UPDATE "DataLokasiLibCaffe" SET "deleted_at" = '2023-06-04 09:02:43', "updated_at" = '2023-06-04 09:02:43'
WHERE "id" IN ('15')
AND "deleted_at" IS NULL
---
    public function hapus_dataa($id)
    {

        if (!$this->tabledatalokasilibcaffe->delete($id)) {

SELECT *
FROM "DataLokasiLibCaffe"
WHERE "DataLokasiLibCaffe"."deleted_at" IS NULL
AND "DataLokasiLibCaffe"."id" = '15'
---
    public function edit_dataa($id)
    {
        $data['dataobjek'] = $this->tabledatalokasilibcaffe->find($id);

UPDATE "DataLokasiLibCaffe" SET "nama" = 'Random', "deskripsi" = 'Uji coba                        ', "latitude" = '-6.91484', "longitude" = '107.60216', "foto" = 'World_Map_Wallpapers_High_Resolution_-_Wallpaper_Cave.png', "updated_at" = '2023-06-04 09:02:31'
WHERE "DataLokasiLibCaffe"."id" IN ('15')
---
            'foto' => $nama_foto
        ];

        if (!$this->tabledatalokasilibcaffe->save($data)) {